---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConvertSplineToLineFailed
source: html/a57df87c-76b9-15fb-2894-3214308a1535.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConvertSplineToLineFailed Property

Failed to convert spline to straight line

## Syntax (C#)
```csharp
public static FailureDefinitionId ConvertSplineToLineFailed { get; }
```